Tekla Open API Reference for Tekla Structures 2025
MaterialItem.Select Method
Overload List
Name | Description
Select()
 Selects the material item from the database based on the material name and alias name in this instance.
Select(String)
 Selects the material item based on the name from the material database. The material name can also be an alias name.
Top
See Also
Reference
MaterialItem Class
Tekla.Structures.Catalogs Namespace